## Задание 1. Напишите программу, которая считывает два целых числа a и b и выводит на экран квадрат суммы  (a+b)2 и сумму квадратов a2+b2 этих чисел.

Input: 
3
2

Output:
Квадрат суммы 3 и 2 равен 25
Сумма квадратов 3 и 2 равна 13


num1 = int(input())
num2 = int(input())
result1 = (num1 + num2) ** 2
result2 = num1 ** 2 + num2 ** 2
print(f'Квадрат суммы {num1} и {num2} равен {result1}')
print(f'Суммы квадратов {num1} и {num2} равна {result2}')




## Задание 2.1
Напишите программу, которая проверяет здоровье персонажа в игре. 
Если оно равно или меньше нуля, выведите на экран False, в противном случае True.

health = int(input())
if health <= 0:
    print('False')
else:
    print('True')


## Задание 2.2
Напишите программу, которая проверяет является ли введенное число четным. Если да, выведите на экран текст “Четное”, а иначе - “Нечетное”

num = int(input())
if num % 2 == 0:
    print('Четное')
else:
    print('Нечетное')

## Задание 2.3
Напишите программу, которая проверяет является ли год високосным. Таковыми считаются года, которые делятся без остатка на 4 (2004, 2008) и не являются столетиями (500, 600). Однако, если год делится без остатка  на 400, он также считается високосным (1200, 2000)

## Задание 2.4
Напишите программу, которая печатает введенный текст заданное количество раз, построчно. Текст и количество повторений нужно ввести с помощью input()

str = input()
num = int(input())
for i in range (num):
    print(str)

## Задание 2.5.
Напишите программу-калькулятор, которая принимает два числа и оператор (в формате str), производит заданное арифметическое действие и печатает результат в формате: {num1} {operator) {num2) = {result}

num1 = int(input())
num2 = int(input())
operator = input()
if operator == '+':
    result = num1 + num2
elif operator == '-':
    result = num1 - num2
elif operator == '/':
    result = num1 / num2
elif operator == '*':
    result = num1 * num2

print(f'{num1} {operator} {num2} = {result}')
